app/views/rooms/new.html.erb

          <option value="">チャットするユーザーを選択してください</option>
          <% User.all.where.not(id: current_user.id).each do |user| %>
---
SELECT `users`.* FROM `users`