app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @room = Room.find(params[:room_id])
    @messages = @room.messages.includes(:user)
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1
SELECT `rooms`.* FROM `rooms` INNER JOIN `room_users` ON `rooms`.`id` = `room_users`.`room_id` WHERE `room_users`.`user_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @room = Room.find(params[:room_id])
    @message = @room.messages.new(message_params)
    if @message.save
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
INSERT INTO `messages` (`content`, `room_id`, `user_id`, `created_at`, `updated_at`) VALUES ('コンんちは', 1, 1, '2020-08-05 08:17:38.310359', '2020-08-05 08:17:38.310359')