app/controllers/rooms_controller.rb

INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES ('テストチャット', '2020-08-05 07:48:28.676678', '2020-08-05 07:48:28.676678')
---
  def create
    @room = Room.new(room_params)
    if @room.save

SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
DELETE FROM `rooms` WHERE `rooms`.`id` = 1
---
  def destroy
    room = Room.find(params[:id])
    room.destroy